In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame()

In [3]:
type(df1)

pandas.core.frame.DataFrame

In [4]:
print(df1)

Empty DataFrame
Columns: []
Index: []

In [5]:
df1

Empty DataFrame
Columns: []
Index: []

In [6]:
df.1 colums

SyntaxError: invalid syntax (1850845284.py, line 1)

In [7]:
df1 columns

SyntaxError: invalid syntax (18335966.py, line 1)

In [8]:
df1.columns

RangeIndex(start=0, stop=0, step=1)

In [9]:
df1.index

RangeIndex(start=0, stop=0, step=1)

In [10]:
students_list = [['Bob','William',26,'Computer Engineering',86],
                ['Emma','Johnson',23,'Math',92],
                ['Sarah','Smith',22,'Chemistry',95],
                ['Alex','Brown',21,'Electrical Engineering',82]]

In [11]:
students_df = pd.DataFrame(students_list)

In [12]:
students_df

       0        1   2                       3   4
0    Bob  William  26    Computer Engineering  86
1   Emma  Johnson  23                    Math  92
2  Sarah    Smith  22               Chemistry  95
3   Alex    Brown  21  Electrical Engineering  82

In [13]:
students_df = pd.DataFrame(students_list,colums=['First_Name','Last_Name','Age','Major','Score'])

TypeError: DataFrame.__init__() got an unexpected keyword argument 'colums'

In [14]:
students_df = pd.DataFrame(students_list,columns=['First_Name','Last_Name','Age','Major','Score'])

In [15]:
studens_df

NameError: name 'studens_df' is not defined

In [16]:
students_df

  First_Name Last_Name  Age                   Major  Score
0        Bob   William   26    Computer Engineering     86
1       Emma   Johnson   23                    Math     92
2      Sarah     Smith   22               Chemistry     95
3       Alex     Brown   21  Electrical Engineering     82

In [17]:
students_df = pd.DataFrame(students_list,columns=['First_Name','Last_Name','Age','Major','Score'],
                          index = ['bob@mail.com','emma@mail.com','Sarah@mail.com','Alex@mail.com'])

In [18]:
students_df

               First_Name Last_Name  Age                   Major  Score
bob@mail.com          Bob   William   26    Computer Engineering     86
emma@mail.com        Emma   Johnson   23                    Math     92
Sarah@mail.com      Sarah     Smith   22               Chemistry     95
Alex@mail.com        Alex     Brown   21  Electrical Engineering     82

In [19]:
student_dict = {'First_Name':['Bob','Emma','Sarah','Alex'],
               'Last_Name':['William','Johnson','Smit','Brown'],
               'Age':[26,23,22,21],
               'Major':['ComputerEngineering','Math','Chemistry','Electrical Engineering'],
               'Score':[86,92,95,82],}

In [20]:
students_df2 = pd.DataFrame(students_dict)

NameError: name 'students_dict' is not defined

In [21]:
udents_df2 = pd.DataFrame(student_dict)

In [22]:
student_df2

NameError: name 'student_df2' is not defined

In [23]:
student_df2 = pd.DataFrame(student_dict)

In [24]:
student_df2

  First_Name Last_Name  Age                   Major  Score
0        Bob   William   26     ComputerEngineering     86
1       Emma   Johnson   23                    Math     92
2      Sarah      Smit   22               Chemistry     95
3       Alex     Brown   21  Electrical Engineering     82

In [25]:
student_df2 = pd.DataFrame(student_dict.columns=['Last_Name','Score'])

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (1366954712.py, line 1)

In [26]:
student_df2 = pd.DataFrame(student_dict,columns=['Last_Name','Score'])

In [27]:
student_df2

  Last_Name  Score
0   William     86
1   Johnson     92
2      Smit     95
3     Brown     82

In [28]:
student_df2 = pd.DataFrame(student_dict,columns=['Last_Name','Score','City'])

In [29]:
studenf_df2

NameError: name 'studenf_df2' is not defined

In [30]:
student_df2

  Last_Name  Score City
0   William     86  NaN
1   Johnson     92  NaN
2      Smit     95  NaN
3     Brown     82  NaN

In [31]:
students_df

               First_Name Last_Name  Age                   Major  Score
bob@mail.com          Bob   William   26    Computer Engineering     86
emma@mail.com        Emma   Johnson   23                    Math     92
Sarah@mail.com      Sarah     Smith   22               Chemistry     95
Alex@mail.com        Alex     Brown   21  Electrical Engineering     82

In [32]:
students_df.columns

Index(['First_Name', 'Last_Name', 'Age', 'Major', 'Score'], dtype='object')

In [33]:
students_df.index

Index(['bob@mail.com', 'emma@mail.com', 'Sarah@mail.com', 'Alex@mail.com'], dtype='object')

In [34]:
students_df.shape

(4, 5)

In [35]:
students_df.head(2)

              First_Name Last_Name  Age                 Major  Score
bob@mail.com         Bob   William   26  Computer Engineering     86
emma@mail.com       Emma   Johnson   23                  Math     92

In [36]:
students_df.tail(3)

               First_Name Last_Name  Age                   Major  Score
emma@mail.com        Emma   Johnson   23                    Math     92
Sarah@mail.com      Sarah     Smith   22               Chemistry     95
Alex@mail.com        Alex     Brown   21  Electrical Engineering     82

In [1]:
students_df.tail(3)

NameError: name 'students_df' is not defined